{"format": "graph-model", "generatedBy": "1.14.0", "weightsManifest": [{"weights": [{"dtype": "float32", "shape": [10], "name": "output/bias"}, {"dtype": "float32", "shape": [64, 10], "name": "output/kernel"}, {"dtype": "float32", "shape": [64], "name": "fc2/bias"}, {"dtype": "float32", "shape": [64, 64], "name": "fc2/kernel"}, {"dtype": "float32", "shape": [64], "name": "fc1/bias"}, {"dtype": "float32", "shape": [784, 64], "name": "fc1/kernel"}], "paths": ["group1-shard1of1.bin"]}], "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"library": {}, "node": [{"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}, "name": "output/bias"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}}, "name": "output/kernel"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "fc2/bias"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}}, "name": "fc2/kernel"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}, "name": "fc1/bias"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "64"}]}}}}, "name": "fc1/kernel"}, {"op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "name": "input"}, {"op": "MatMul", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}, "input": ["input", "fc1/kernel"], "name": "fc1/MatMul"}, {"op": "BiasAdd", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["fc1/MatMul", "fc1/bias"], "name": "fc1/BiasAdd"}, {"op": "Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["fc1/BiasAdd"], "name": "fc1/Relu"}, {"op": "MatMul", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}, "input": ["fc1/Relu", "fc2/kernel"], "name": "fc2/MatMul"}, {"op": "BiasAdd", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["fc2/MatMul", "fc2/bias"], "name": "fc2/BiasAdd"}, {"op": "Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["fc2/BiasAdd"], "name": "fc2/Relu"}, {"op": "MatMul", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}, "input": ["fc2/Relu", "output/kernel"], "name": "output/MatMul"}, {"op": "BiasAdd", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["output/MatMul", "output/bias"], "name": "output/BiasAdd"}, {"op": "Softmax", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["output/BiasAdd"], "name": "output/Softmax"}], "versions": {"producer": 38}}}