{"class_name": "Sequential", "config": {"name": "sequential_1", "build_input_shape": [null, 784], "layers": [{"class_name": "Dense", "config": {"name": "fc1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "units": 64, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"name": "fc2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "units": 64, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"name": "output", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "units": 10, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}]}, "backend": "tensorflow", "keras_version": "2.2.4"}