{"config": {"layers": [{"config": {"batch_input_shape": [null, 784], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 64, "name": "fc1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "activation": "relu", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 64, "name": "fc2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "activation": "relu", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 10, "name": "output", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "activation": "softmax", "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}