{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "dtype": "float32", "scale": 1.0, "distribution": "uniform"}}, "name": "fc1", "trainable": true, "batch_input_shape": [null, 784], "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "units": 64, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "dtype": "float32", "scale": 1.0, "distribution": "uniform"}}, "name": "fc2", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "units": 64, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "dtype": "float32", "scale": 1.0, "distribution": "uniform"}}, "name": "output", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "units": 10, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}]}}, "keras_version": "2.2.4-tf", "backend": "tensorflow", "training_config": {"weighted_metrics": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "Adam", "config": {"learning_rate": 0.0010000000474974513, "beta_1": 0.8999999761581421, "name": "Adam", "epsilon": 1e-07, "beta_2": 0.9990000128746033, "decay": 0.0, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "fc1/kernel", "dtype": "float32", "shape": [784, 64]}, {"name": "fc1/bias", "dtype": "float32", "shape": [64]}, {"name": "fc2/kernel", "dtype": "float32", "shape": [64, 64]}, {"name": "fc2/bias", "dtype": "float32", "shape": [64]}, {"name": "output/kernel", "dtype": "float32", "shape": [64, 10]}, {"name": "output/bias", "dtype": "float32", "shape": [10]}]}]}